In this video we will learn about how to modify a DataFrame using the inplace parameter. We will first read a real dataset into pandas. We will then introduce pandas' inplace parameter and see how it impacts a method's execution end result. We will also execute methods with and without inplace parameters to demonstrate the effect of inplace.

In [13]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [14]:
%cd /content/drive/My Drive/Colab Notebooks

/content/drive/My Drive/Colab Notebooks

In [15]:
import pandas as pd
# We will read our dataset.
top_movies = pd.read_table('data-movies-top-grossing.csv', sep=',')

Since it is a CSV file, we are using pandas'read_csv function for this. Now, that we have read in our dataset into a DataFrame, let's take a look at a few of the records.

In [16]:
top_movies

    Rank                                          Title Worldwide gross  Year
0      1                                         Avatar  $2,787,965,087  2009
1      2                                        Titanic  $2,186,772,302  1997
2      3                   Star Wars: The Force Awakens  $2,068,223,624  2015
3      4                                 Jurassic World  $1,671,713,208  2015
4      5                                   The Avengers  $1,518,812,988  2012
5      6                                      Furious 7  $1,516,045,911  2015
6      7                        Avengers: Age of Ultron  $1,405,403,694  2015
7      8  Harry Potter and the Deathly Hallows â€“ Part 2  $1,341,511,219  2011
8      9                                         Frozen  $1,287,000,000  2013
9     10                           Beauty and the Beast  $1,257,024,611  2017
10    11                        The Fate of the Furious  $1,238,290,870  2017
11    12                                     Iron Man 3  $1,214,811,252  2013
12    13                                        Minions  $1,159,398,397  2015
13    14                     Captain America: Civil War  $1,153,304,495  2016
14    15                 Transformers: Dark of the Moon  $1,123,794,079  2011
15    16  The Lord of the Rings: The Return of the King  $1,120,237,002  2003
16    17                                        Skyfall  $1,108,561,013  2012
17    18                Transformers: Age of Extinction  $1,104,054,072  2014
18    19                          The Dark Knight Rises  $1,084,939,099  2012
19    20                                    Toy Story 3  $1,066,969,703  2010
20    21     Pirates of the Caribbean: Dead Man's Chest  $1,066,179,725  2006
21    22                   Rogue One: A Star Wars Story  $1,056,057,273  2016
22    23    Pirates of the Caribbean: On Stranger Tides  $1,045,713,802  2011
23    24                                  Jurassic Park  $1,029,939,903  1993
24    25                                   Finding Dory  $1,028,570,889  2016
25    26      Star Wars: Episode I â€“ The Phantom Menace  $1,027,044,677  1999
26    27                            Alice in Wonderland  $1,025,467,110  2010
27    28                                       Zootopia  $1,023,784,195  2016
28    29              The Hobbit: An Unexpected Journey  $1,021,103,568  2012
29    30                                The Dark Knight  $1,004,558,444  2008
30    31       Harry Potter and the Philosopher's Stone    $974,755,371  2001
31    32                                Despicable Me 2    $970,761,885  2013
32    33                                  The Lion King    $968,483,777  1994
33    34                                The Jungle Book    $966,550,600  2016
34    35       Pirates of the Caribbean: At World's End    $963,420,425  2007
35    36  Harry Potter and the Deathly Hallows â€“ Part 1    $960,283,305  2010
36    37            The Hobbit: The Desolation of Smaug    $958,366,855  2013
37    38      The Hobbit: The Battle of the Five Armies    $956,019,788  2014
38    39                                   Finding Nemo    $940,335,536  2003
39    40      Harry Potter and the Order of the Phoenix    $939,885,929  2007
40    41         Harry Potter and the Half-Blood Prince    $934,416,487  2009
41    42          The Lord of the Rings: The Two Towers    $926,349,708  2002
42    43                                        Shrek 2    $919,838,758  2004
43    44            Harry Potter and the Goblet of Fire    $896,911,078  2005
44    45                                   Spider-Man 3    $890,871,626  2007
45    46                 Ice Age: Dawn of the Dinosaurs    $886,686,817  2009
46    47                                        Spectre    $880,674,609  2015
47    48        Harry Potter and the Chamber of Secrets    $878,979,634  2002
48    49                     Ice Age: Continental Drift    $877,244,782  2012
49    50                        The Secret Life of Pets    $875,457,937  2016

The data we are using from Wikipedia, it is the cross annex data for top movies worldwide. Most pandas DataFrame methods return a new DataFrame. However, you might want to use a method to modify the original DataFrame itself. This is where the inplace parameter is useful. First let's call a method on a DataFrame without the inplace parameter to see how it works in the code.

In [17]:
top_movies.set_index('Rank').head()

                             Title Worldwide gross  Year
Rank
1                           Avatar  $2,787,965,087  2009
2                          Titanic  $2,186,772,302  1997
3     Star Wars: The Force Awakens  $2,068,223,624  2015
4                   Jurassic World  $1,671,713,208  2015
5                     The Avengers  $1,518,812,988  2012

Here we are setting one of the columns as the index for our DataFrame. We can see that the index has been set in the memory. Let's check now to see if it has modified the original DataFrame or not.

In [18]:
top_movies.head()

   Rank                         Title Worldwide gross  Year
0     1                        Avatar  $2,787,965,087  2009
1     2                       Titanic  $2,186,772,302  1997
2     3  Star Wars: The Force Awakens  $2,068,223,624  2015
3     4                Jurassic World  $1,671,713,208  2015
4     5                  The Avengers  $1,518,812,988  2012

We can see that in the original DataFrame there has been no chnage. The set_index method only created the change in a completely new DataFrame in memory, which we could have saved in a new DataFrame. Now let's see how it works if we pass the inplace parameter.

In [20]:
top_movies.set_index('Rank', inplace=True)

In [21]:
top_movies.head()

                             Title Worldwide gross  Year
Rank
1                           Avatar  $2,787,965,087  2009
2                          Titanic  $2,186,772,302  1997
3     Star Wars: The Force Awakens  $2,068,223,624  2015
4                   Jurassic World  $1,671,713,208  2015
5                     The Avengers  $1,518,812,988  2012

We can see that passing inplace=True did modify the original DataFrame. Not all methods require the use of the inplace parameter to modify the original DataFrame. For example, the rename(columns) method modifies the original DataFrame, without the needfor the inplace parameter.

In [22]:
top_movies.rename(columns={'Year':'Release Year'}).head()
# Changing the name of the column from year to release year

                             Title Worldwide gross  Release Year
Rank
1                           Avatar  $2,787,965,087          2009
2                          Titanic  $2,186,772,302          1997
3     Star Wars: The Force Awakens  $2,068,223,624          2015
4                   Jurassic World  $1,671,713,208          2015
5                     The Avengers  $1,518,812,988          2012

It is a good idea to get familiar with which methods need inplace and which do not. In this video, we did learn about how to modify a DataFrame using the inplace parameter. We did introduce pandas inplace parameter and how it impacts a method's execution end reuslt. We did explore the execution of methods with and without the inplace parameter to demonstrate the difference in the result.